import { type NextPage } from 'next'
import Head from 'next/head'

const Uterms: NextPage = () => {
    return (
        <>
            <Head>
                <title>Пользовательское соглашение | T3-Ecom</title>
                <meta name='description' content='Пользовательское соглашение' />
            </Head>
            <main>
                <h1>Пользовательское Соглашение</h1>
                <div>
                    <h2>Пользовательское Соглашение</h2>
                    <div>
                        Настоящее Пользовательское Соглашение (Далее Соглашение) регулирует
                        отношения между владельцем localhost:3000 (далее feela-t3-ecom или
                        Администрация) с одной стороны и пользователем сайта с другой.
                    </div>
                    <div>Сайт feela-t3-ecom не является средством массовой информации.</div>
                    <br />
                    <div>Используя сайт, Вы соглашаетесь с условиями данного соглашения.</div>
                    <div>
                        <b>
                            Если Вы не согласны с условиями данного соглашения, не используйте сайт
                            feela-t3-ecom!
                        </b>
                    </div>
                    <h2>Предмет соглашения</h2>
                    <div>
                        <b>
                            Администрация предоставляет пользователю право на размещение на сайте
                            следующей информации:
                        </b>
                    </div>
                    <ul>
                        <li>- Текстовой информации</li>
                        <li>- Ссылок на материалы, размещенные на других сайтах</li>
                    </ul>
                    <h2>Права и обязанности сторон</h2>
                    <div>
                        <b>Пользователь имеет право:</b>
                    </div>
                    <ul>
                        <li>- осуществлять поиск информации на сайте</li>
                        <li>- получать информацию на сайте</li>
                        <li>- комментировать контент, выложенный на сайте</li>
                        <li>- копировать информацию на другие сайты с указанием источника</li>
                        <li>- использовать информацию сайта в личных некоммерческих целях</li>
                    </ul>
                    <div>
                        <b>Администрация имеет право:</b>
                    </div>
                    <ul>
                        <li>
                            - по своему усмотрению и необходимости создавать, изменять, отменять
                            правила
                        </li>
                        <li>- ограничивать доступ к любой информации на сайте</li>
                        <li>- создавать, изменять, удалять информацию</li>
                        <li>- удалять учетные записи</li>
                    </ul>
                    <div>
                        <b>Пользователь обязуется:</b>
                    </div>
                    <ul>
                        <li>
                            - не распространять информацию, которая направлена на пропаганду войны,
                            разжигание национальной, расовой или религиозной ненависти и вражды, а
                            также иной информации, за распространение которой предусмотрена
                            уголовная или административная ответственность
                        </li>
                        <li>- не нарушать работоспособность сайта</li>
                        <li>
                            - не совершать действия, направленные на введение других Пользователей в
                            заблуждение
                        </li>
                        <li>
                            - не использовать скрипты (программы) для автоматизированного сбора
                            информации и/или взаимодействия с Сайтом и его Сервисами
                        </li>
                    </ul>
                    <div>
                        <b>Администрация обязуется:</b>
                    </div>
                    <ul>
                        <li>
                            - поддерживать работоспособность сайта за исключением случаев, когда это
                            невозможно по независящим от Администрации причинам.
                        </li>
                        <li>
                            - предоставить всю доступную информацию о Пользователе уполномоченным на
                            то органам государственной власти в случаях, установленных законом
                        </li>
                    </ul>
                    <h2>Ответственность сторон</h2>
                    <ul>
                        <li>
                            - пользователь лично несет полную ответственность за распространяемую им
                            информацию
                        </li>
                        <li>
                            - администрация не несет никакой ответственности за услуги,
                            предоставляемые третьими лицами
                        </li>
                        <li>
                            - в случае возникновения форс-мажорной ситуации (боевые действия,
                            чрезвычайное положение, стихийное бедствие и т. д.) Администрация не
                            гарантирует сохранность информации, размещённой Пользователем, а также
                            бесперебойную работу информационного ресурса
                        </li>
                    </ul>
                    <h2>Условия действия Соглашения</h2>
                    <div>
                        Данное Соглашение вступает в силу при любом использовании данного сайта.
                    </div>
                    <div>Соглашение действует бессрочно.</div>
                    <div>
                        Администрация оставляет за собой право в одностороннем порядке изменять
                        данное соглашение по своему усмотрению.
                    </div>
                    <div>Администрация не оповещает пользователей об изменении в Соглашении.</div>
                </div>
            </main>
        </>
    )
}

export default Uterms
